Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: We also set the `java.util.logging` system property to make sure tests will use the correct log manager and `maven.home` to ensure that custom configuration from `${maven.home}/conf/settings.xml` is applied (if any).
ja_jp: また、 `java.util.logging` システムプロパティーを設定して、テストが正しいログマネージャーを使用することを確認し、 `maven.home` からカスタム設定が適用されることを確認します (存在する場合)。

source: We also update the `ReactiveGreetingResource.kt` like so:
ja_jp: また、 `ReactiveGreetingResource.kt` を次のように更新しています。

source: We also update the `ReactiveGreetingResource` class like so:
ja_jp: また、 `ReactiveGreetingResource` を次のように更新します:

source: We also upgraded our Maven internal dependencies to 3.8.1.
ja_jp: また、Mavenの内部依存関係を3.8.1にアップグレードしました。

source: We also want to thank all the extension maintainers from the Quarkiverse and beyond who worked hard on getting the extension ecosystem ready for Quarkus 3.0.
ja_jp: また、Quarkus 3.0に対応したエクステンションエコシステムの準備に尽力してくれた、Quarkiverseやそれ以外のエクステンションメンテナにも感謝したいと思います。

source: We applaud the Java and security communities and in particular the Log4J 2 contributors for their swift response to this critical issue.
ja_jp: この重大な問題に迅速に対応したJavaとセキュリティコミュニティ、特にLog4J 2のコントリビューターに賞賛を送ります。

source: We are a bit more aggressive with this one and we include some stemming: we will be able to search for `mystery` and get a result even if the indexed input contains `mysteries`. It is definitely too aggressive for person names but it is perfect for the book titles.
ja_jp: インデックス化された入力に `mysteries` が含まれていても、 `mystery` を検索して結果を得ることができます。 人名には確かに強引すぎますが、書籍のタイトルには最適です。

source: We are a bit more aggressive with this one and we include some stemming: we will be able to search for `mystery` and get a result even if the indexed input contains `mysteries`. It is definitely too aggressive for person names, but it is perfect for the book titles.
ja_jp: これはもう少し積極的で、ステミングも含まれています。インデックス化された入力に `mysteries` が含まれていても、 `mystery` を検索して結果を得ることができます。人名に対しては確かに強引すぎますが、書籍のタイトルに対しては完璧です。

source: We are able to use the `Character` interface because the `SearchResult` union contains members that implement it.
ja_jp: `Character` インターフェースを使用できるのは、 `SearchResult` ユニオンにそれを実装したメンバが含まれているからです。

source: We are aligning Quarkus docs with the Diátaxis documentation framework{fn-diataxis}, which defines a core content structure that addresses the different needs users have when consulting docs. What follows is a brief summary of the different document types, but their site is worth a read if you want to understand more of the reasoning behind this classification.
ja_jp: Quarkus のドキュメントは、Diátaxis ドキュメントフレームワーク {fn-diataxis} に合わせています。これは、ユーザーがドキュメントを参照する際に持つそれぞれのニーズに対応するための、コアとなるコンテンツ構造を定義しています。以下に、さまざまなドキュメントタイプを説明した簡単な要約を示していますが、各サイトはそれぞれ一読の価値がありますので、分類された理由の詳細については各サイトを参照してください。

source: We are already familiar with xref:dev-services.adoc[Dev Service] concept, but in the case of Observability we need a way to orchestrate and connect more than a single Dev Service, usually a whole stack of them; e.g. a metrics agent periodically scraping application for metrics, pushing them into timeseries database, and Grafana feeding graphs of this timeseries data.
ja_jp: xref:dev-services.adoc[Dev Service] の概念には慣れていますが、Observability の場合、単一の Dev Service だけでなく、通常はそれらのスタック全体をオーケストレーションして接続する方法が必要です。たとえば、メトリクスエージェントが定期的にアプリケーションからメトリクスをスクレイピングし、それをタイムシリーズデータベースに送信し、Grafana がそのタイムシリーズデータのグラフを表示する、といった具合です。

source: We are aware that the update to Quarkus 3.0 will require some work and testing on your side, especially if you are using Hibernate ORM.
ja_jp: Quarkus 3.0へのアップデートは、特にHibernate ORMを使用している場合、お客様側でいくつかの作業とテストが必要になることを認識しています。

source: We are continuing to enrich the RESTEasy Reactive experience and, this time, it's on the REST Client front. A new RESTEasy Reactive-based REST Client extension `quarkus-rest-client-reactive` is present in Quarkus 1.13.
ja_jp: 私たちはRESTEasy Reactiveの体験をより豊かなものにするために、今回はRESTクライアントの面での取り組みを続けています。新しいRESTEasy ReactiveベースのRESTクライアントエクステンション `quarkus-rest-client-reactive` がQuarkus 1.13に搭載されています。

source: We are fully vested in Quarkus at this point. It is the heart of our new platform, and the only regret is not making the jump sooner.
ja_jp: 現時点では、Quarkusに完全に傾倒しています。Quarkusは私たちの新しいプラットフォームの心臓部であり、後悔しているのはもっと早くに移行しなかったことです。

source: We are going to build a simple application exposing four HTTP endpoints:
ja_jp: ここでは、4つのHTTPエンドポイントを公開するシンプルなアプリケーションを作成します。

source: We are going to create a Gradle multi module project with those two modules. Here is a simple `settings.gradle` example file:
ja_jp: この2つのモジュールを使って、Gradleのマルチモジュールプロジェクトを作ってみます。これが、簡単な `settings.gradle` のサンプルファイルです。

source: We are going to create a Gradle multi-module project with those two modules. Here is a simple `settings.gradle` example file:
ja_jp: この2つのモジュールから構成される、Gradleのマルチモジュールプロジェクトを作ってみます。これが、簡単な `settings.gradle` のサンプルファイルです。

source: We are going to create an `IncrementService` class which will play the role of a Redis client. With this class, we'll be able to perform the `SET`, `GET` , `DELET`, `KEYS` and `INCRBY` Redis commands.
ja_jp: Redis クライアントの役割を果たす `IncrementService` クラスを作成します。このクラスで、 `SET` 、 `GET` 、 `DELET` 、 `KEYS` 、 `INCRBY` Redis コマンドを実行できるようになります。

source: We are going to create an `IncrementService` class which will play the role of a Redis client. With this class, we'll be able to perform the `SET`, `GET` , `DEL`, `KEYS` and `INCRBY` Redis commands.
ja_jp: Redis クライアントの役割を果たす `IncrementService` クラスを作成します。このクラスで、 `SET` 、 `GET` 、 `DEL` 、 `KEYS` 、 `INCRBY` Redis コマンドを実行できるようになります。

source: We are going to create our serialization schema using the `GreetingSchema` interface. Create the `src/main/java/org/acme/infinispan/client/GreetingSchema.java` file, with the following content:
ja_jp: `GreetingSchema` インターフェイスを使用して、シリアライズスキーマを作成します。以下の内容で、 `src/main/java/org/acme/infinispan/client/GreetingSchema.java` ファイルを作成します:

source: We are going to model our increments using the `Greeting` POJO. Create the `src/main/java/org/acme/infinispan/client/Greeting.java` file, with the following content:
ja_jp: `Greeting` POJOを使用して雛形を少しずつ作っていきましょう。次の内容で、 `src/main/java/org/acme/infinispan/client/Greeting.java` ファイルを作成します:

source: We are going to model our increments using the `Increment` POJO. Create the `src/main/java/org/acme/redis/Increment.java` file, with the following content:
ja_jp: `Increment` POJO を使用してインクリメントをモデル化します。 `src/main/java/org/acme/redis/Increment.java` ファイルを作成し、以下の内容で作成します。

source: We are going to produce ``BytecodeTransformerBuildItem``s.
ja_jp: `BytecodeTransformerBuildItem`sを作成します。

source: We are here to help should you require further guidance with creating stricter, tighter OIDC configurations. Do open issues, and reach out to the team on Quarkus Discussions, Zulip users channel.
ja_jp: より厳格でタイトな OIDC 設定の作成に関するさらなるガイダンスが必要な場合は、私たちがお手伝いします。Issue を作成したり、Quarkus Discussions や Zulip の users チャネルでチームに連絡したりしてください。

source: We are including code from the source file while using Asciidoc tagged regions to exclude the `goodbye` method from the listing.
ja_jp: リストから `goodbye` メソッドを除外するために Asciidoc タグ付き領域を使用しながら、ソースファイルからのコードを含めています。

source: We are including the public key as a resource in the native executable.
ja_jp: ネイティブ実行可能ファイルのリソースとして公開鍵を含めています。

source: We are loading these elements eagerly so that they are present in the JSON output. In a real world application, you should probably use a DTO approach.
ja_jp: 私たちは、これらの要素がJSON出力に存在するように前もってロードしています。実際のアプリケーションでは、おそらくDTOアプローチを使うべきでしょう。

source: We are looking forward to everyone testing it and providing us as much feedback as possible. In typical Quarkus fashion, the project is consumable as a new set of extensions.
ja_jp: 皆さまにテストしていただき、できるだけ多くのフィードバックを提供していただけると幸いです。 典型的なQuarkusのやり方で、このプロジェクトは新しいエクステンションのセットとして利用可能です。

source: We are now ready to test our GUI in React development mode.
ja_jp: これで、Reactの開発モードでGUIをテストする準備が整いました。

source: We are pleased to announce the release of A2A Java SDK 1.0.0.Alpha2. This release brings significant new features and improvements as we continue to align with the https://a2a-protocol.org/latest/specification/[A2A 1.0 specification].
ja_jp: A2A Java SDK 1.0.0.Alpha2 のリリースをお知らせします。このリリースでは、 https://a2a-protocol.org/latest/specification/[A2A 1.0 仕様] への準拠を継続し、重要な新機能と改善が導入されています。

source: We are quickly moving to an SSL-everywhere world so being able to use SSL is crucial.
ja_jp: 常時SSL接続の時代へと急速に移行しているので、SSLを利用できることは非常に重要です。

source: We are registering the most common implementations but, depending on your cache configuration, you might encounter errors like:
ja_jp: ここでは、最も一般的な実装を登録していますが、キャッシュの設定によっては、以下のようなエラーが発生する場合があります。

source: We are running in a double developer mode now. Any changes made to either your Java or Javascript code will be applied immediately. Isn't that developer bliss?
ja_jp: 現在、ダブルデベロッパーモードで運用しています。JavaとJavascriptのどちらかのコードに加えられた変更は、すぐに適用されます。これは開発者にとって至福の時ではないでしょうか。

source: We are setting public key location to point to a classpath publicKey.pem location. We will add this key in part B, <<Adding a Public Key>>.
ja_jp: クラスパス publicKey.pem の場所を指すように公開鍵の場所を設定しています。この鍵はパート B <<公開鍵の追加>> で追加します。

source: We are setting public key location to point to a classpath publicKey.pem location. We will add this key in part B, xref:add-public-key[Adding a Public Key].
ja_jp: 公開鍵の場所は、クラスパスのpublicKey.pemの場所を指すように設定しています。この鍵は、パートB xref:add-public-key[公開鍵の追加] で追加します。

source: We are setting the issuer to the URL string `https://example.com/issuer`.
ja_jp: 発行者を URL 文字列 `https://example.com/issuer` に設定しています。

source: We are still working on publishing it everywhere for easy consumption on all systems but you can already use JBang to run it.
ja_jp: すべてのシステムで簡単に利用できるように、どこにでも公開できるようにまだ取り組んでいますが、すでに実行にJBangを使うことが出来ます。

source: We are taking requests… if you had a tour stop before, we can create a new experience to give your JUG a fresh deeper look at Quarkus. No Freebird or Stairway to Heaven. ;)
ja_jp: リクエストを受け付けています...以前にツアーに参加したことがある場合も、JUGの皆さんにQuarkusをより深く新鮮に感じてもらうために、新しい体験をすることができます。FreebirdやStairway to Heavenはありません。）

source: We are using Hibernate ORM with Panache, it is not mandatory.
ja_jp: Hibernate ORM with Panacheを使用していますが、必須ではありません。

source: We are using `curl -w "\n"` in this example to avoid your terminal printing a '%' or put both result and next command prompt on the same line.
ja_jp: この例では `curl -w "\n"` を使用して、結果とプロンプトが1行で表示されてしまうことを防止しています。

source: We are using a nested static public class instead of a top level class for two reasons:
ja_jp: トップレベルのクラスではなく、ネストされた静的パブリッククラスを使用しているのには、2つの理由があります。

source: We are verifying that we get the mocked response from the Spy.
ja_jp: 私たちは、スパイからのモックされた応答を得ることを検証しています。

source: We are very much looking forward to hearing your thoughts about and experience using RESTEasy Reactive in Quarkus and plan to put it to good use to further improve the project.
ja_jp: プロジェクトのさらなる改善の為に、RESTEasy ReactiveをQuarkusで使用した感想や経験を是非お聞かせ下さい。

source: We are very pleased to announce the 1.10.0 release of Quarkus Tools for IntelliJ. This release adds support for Quarkus run/debug configurations and provides several fixes (including security fixes).
ja_jp: Quarkus Tools for IntelliJの1.10.0リリースを発表できることを大変嬉しく思っています。このリリースでは、Quarkusの実行／デバッグ構成のサポートが追加され、いくつかの修正（セキュリティ修正を含む）が行われています。

source: We are very pleased to announce the 1.11.0 release of Quarkus Tools for IntelliJ. This release adds support for Qute templates but also align with LSP4MP 0.4.0 and quarkus-ls 0.11.1.
ja_jp: Quarkus Tools for IntelliJの1.11.0リリースを発表できることを大変嬉しく思います。このリリースでは、Quteテンプレートのサポートが追加され、LSP4MP 0.4.0およびquarkus-ls 0.11.1との整合性もとられています。

source: We are very pleased to announce the 1.3.0 release of Quarkus Tools for IntelliJ. This release brings codestarts support in the Quarkus project wizard.
ja_jp: Quarkus Tools for IntelliJの1.3.0リリースを発表できることを大変嬉しく思います。このリリースでは、Quarkusプロジェクトウィザードにcodestartsのサポートが追加されました。

source: We are very pleased to announce the 1.4.0 release of Quarkus Tools for IntelliJ. This release enhances codestarts support in the Quarkus project wizard.
ja_jp: Quarkus Tools for IntelliJの1.4.0リリースを発表できることを大変嬉しく思います。このリリースでは、Quarkusプロジェクトウィザードのcodestartsのサポートが強化されました。

source: We are very pleased to announce the 1.8.0 release of Quarkus Tools for IntelliJ. This release adds support for CodeLens for REST endpoints and enhances MicroProfile Fault Tolerance and Metrics supports.
ja_jp: Quarkus Tools for IntelliJの1.8.0リリースを発表できることを嬉しく思います。このリリースでは、CodeLens for RESTエンドポイントのサポートが追加され、MicroProfile Fault ToleranceとMetricsのサポートが強化されています。

source: We are very pleased to announce the 1.9.0 release of Quarkus Tools for IntelliJ. This release adds support for Quarkus streams in the new project/module Quarkus wizard and fixes compatibilities with just released IntelliJ 2021.3.
ja_jp: Quarkus Tools for IntelliJの1.9.0リリースを発表できることを大変嬉しく思います。このリリースでは、新しいプロジェクト／モジュールのQuarkusウィザードでQuarkusストリームのサポートが追加され、リリースされたばかりのIntelliJ 2021.3との互換性が修正されています。

source: We are working full steam on polishing Quarkus 3.0 so please try it with your applications and report any problem to us by https://github.com/quarkusio/quarkus/issues[creating a GitHub issue].
ja_jp: 私たちはQuarkus 3.0の改良に全力を注いでいます。あなたのアプリケーションで試してみて、問題があれば https://github.com/quarkusio/quarkus/issues[GitHub issueを作成]し私たちに報告してください。

source: We are working on supporting both RESTEasy Classic and RESTEasy Reactive with Kogito and OptaPlanner, this is the first step in this direction and this task will come to completion with Quarkus 2.7.
ja_jp: 私たちは、RESTEasy ClassicとRESTEasy Reactiveの両方をKogitoとOptaPlannerでサポートすることに取り組んでいます。これはこの方向での最初のステップであり、このタスクはQuarkus 2.7で完了する予定です。

source: We assume you are familiar with writing Javadoc comments so let's focus on our Asciidoc support. While standard Javadoc comments are perfectly fine for simple documentation (recommended even), if you want to include tips, source code extracts, lists... Asciidoc comes in handy.
ja_jp: ここでは、Javadocのコメントを書くことに慣れていることを前提としているので、Asciidocのサポートに焦点を当ててみましょう。標準的なJavadocのコメントは単純な文書化には完全に適していますが（推奨されています）、もしあなたがTipsやソースコードの抜粋、リストなどを含めたい場合は、Asciidocが便利です。

source: We believe that in presence of MicroProfile Context Propagation, this requirement should not apply. The entire point of context propagation is to make sure the new thread has the same contexts as the original thread.
ja_jp: MicroProfile Context Propagationがある場合、この要件は適用されるべきではないと考えています。コンテキスト伝搬の主な目的は、新しいスレッドが元のスレッドと同じコンテキストを持っていることを確認することにあります。

source: We call the service interaction an LRA, short for Long Running Action. An LRA has specific properties and guarantees that aid in the construction of reliable service interactions. Each action is assigned a unique identifier (referred to as the LRA context) so that it can be distinguished from other LRAs.
ja_jp: このサービスインタラクションをLRA（Long Running Actionの略）と呼んでいます。LRAは、信頼性の高いサービスインタラクションを構築するための特定の特性と保証を持っています。各アクションには一意の識別子（LRAコンテキスト）が割り当てられ、他のLRAと区別できるようになっています。

source: We can add reader and writer interceptors like this:
ja_jp: 次のようなリーダーとライターのインターセプターを追加できます。

source: We can also leverage inheritance and have `interface Character extends SearchResult`. This will result in all implementations of `Character` being added as members of the `SearchResult` union in the schema.
ja_jp: また、継承を利用して、 `interface Character extends SearchResult` とすることも出来ます。これにより、 `Character` のすべての実装がスキーマの `SearchResult` ユニオンのメンバとして追加されることになります。

source: We can appreciate a distribution named `app` (same as the project's artifactId for convenience) with 3 configured artifacts. Note the use of Maven properties and Mustache templates to define the paths. You may use explicit values if you want or rely on properties to parameterize the configuration. Maven properties resolve eagerly during build validation while Mustache templates resolve lazily during the execution of the JReleaser plugin goals. Each artifact must define a `platform` property that uniquely identifies them. If we run the `./mvnw -Prelease jreleaser:config` we'll quickly get an error as now that there's a configured distribution the plugin expects more metadata to be provided by the project:
ja_jp: 3 つの設定されたアーティファクトを持つ`app`(便宜上プロジェクトの artifactId と同じ) という名前のディストリビューションを評価できます。パスを定義するための Maven プロパティーと Mustache テンプレートの使用に注意してください。設定をパラメーター化するためにプロパティーが必要な場合、またはプロパティーに依存する場合は、明示的な値を使用できます。Maven プロパティーはビルドの検証中に即時に解決されますが、Mustache テンプレートは JReleaser プラグインの目標の実行中に遅延して解決されます。各アーティファクトは、それらを一意に識別する `platform` プロパティーを定義する必要があります。 `./mvnw -Prelease jreleaser:config` を実行すると、プラグインがプロジェクトによって提供されるメタデータが増えることを期待する設定済みのディストリビューションがあるため、すぐにエラーが発生します。

source: We can choose the timer when the sample is stopped. This example uses a response status as a tag identifying the timer, which won't be known until processing is complete.
ja_jp: サンプルが停止されるときのタイマーを選択できます。この例では、タイマーを識別するタグとしてレスポンスステータスを使用しますが、これは処理が完了するまでわかりません。

source: We can create a standard Quarkus and JUnit test to check the behaviour of the Rule Unit and the defined rules, accordingly to a certain set of scenarios.
ja_jp: 特定のシナリオセットに応じて、ルールユニットと定義されたルールの動作を確認するの標準の Quarkus および JUnit テストを作成できます。

source: We can get the `Providers` instance in our filters from the request context as follows:
ja_jp: 次のようにして、リクエストコンテキストからフィルター内の `Providers` インスタンスを取得できます。

source: We can instruct JReleaser to select only artifacts that match macOS at this point by invoking the `jreleaser:config` goal with an additional flag: `./mvnw -Prelease jreleaser:config -Djreleaser.select.current.platform`. This time the command will succeed and print out the model. Note that only the path for the macOS artifact has been fully resolved, leaving the other 2 paths untouched.
ja_jp: 追加のフラグ `./mvnw-Prelease jreleaser:config -Djreleaser.select.current.platform` を指定して `jreleaser:config` ゴールを呼び出すことにより、この時点で macOS に一致するアーティファクトのみを選択するように JReleaser に指示できます。今回はコマンドが成功し、モデルが出力されます。macOS アーティファクトのパスのみが完全に解決されており、他の 2 つのパスは変更されていないことに注意してください。

source: We can invoke the endpoint with a curl command.
ja_jp: curl コマンドを使用してエンドポイントを呼び出すことができます。

source: We can leverage the Mockito API in a test method to configure the behavior.
ja_jp: テストメソッドで Mockito API を活用して動作を設定できます。

source: We can leverage the link:http://maven.apache.org/plugins/maven-assembly-plugin/[maven-assembly-plugin] to create such a distribution. We'll also make use of the link:https://github.com/maveniverse/nisse[Nisse Maven plugin] to properly identify the platform on which this executable can run, adding said platform to the distribution's filename.
ja_jp: このようなディストリビューションを作成するには、 link:http://maven.apache.org/plugins/maven-assembly-plugin/[maven-assembly-plugin] を活用します。 また、 link:https://github.com/maveniverse/nisse[Nisse Mavenプラグイン] を利用して、この実行ファイルが動作するプラットフォームを適切に識別し、ディストリビューションのファイル名にプラットフォームを追加します。

source: We can leverage the link:http://maven.apache.org/plugins/maven-assembly-plugin/[maven-assembly-plugin] to create such a distribution. We'll also make use of the link:https://github.com/trustin/os-maven-plugin[os-maven-plugin] to properly identify the platform on which this executable can run, adding said platform to the distribution's filename.
ja_jp: link:http://maven.apache.org/plugins/maven-assembly-plugin/[maven-assembly-plugin]を利用して、このようなディストリビューションを作成することができます。また、 link:https://github.com/trustin/os-maven-plugin[os-maven-plugin] を利用して、この実行ファイルが実行可能なプラットフォームを適切に識別し、ディストリビューションのファイル名にそのプラットフォームを追加します。

source: We can now configure the Elytron JDBC Realm.
ja_jp: これで、Elytron JDBC Realmを設定することができます。

source: We can now describe how our WebAuthn credentials are stored in our database with three entities. Note that we've simplified the model in order to only store one credential per user (who could actually have more than one WebAuthn credential and other data such as roles):
ja_jp: これで、WebAuthn クレデンシャルがデータベースにどのように保存されるかを、3 つのエンティティで説明できるようになりました。ユーザー (実際には複数の WebAuthn クレデンシャルとロールなどの他のデータを持つことができます) あたり 1 つのクレデンシャルしか保存しないように、モデルを簡略化したことに注意してください。

source: We can now describe how our WebAuthn credentials are stored in our database with two entities. Note that we've simplified the model in order to only store one credential per user (who could actually have more than one WebAuthn credential and other data such as roles):
ja_jp: これで、WebAuthn 認証情報がデータベースにどのように保存されるかを、2 つのエンティティーで説明できるようになりました。 ユーザーごとに認証情報を 1 つしか保存しないように、モデルを簡略化した点に注意してください (ユーザーは実際には複数の WebAuthn 認証情報 とロールなどの他のデータを持つことが可能)。

source: We can now describe how our security information is stored in our model by adding a few annotations to our `User` entity:
ja_jp: これで、 `User` エンティティーにいくつかのアノテーションを追加することで、セキュリティー情報がモデルにどのように保存されているかを説明することができます:

source: We can now examine line `169` and get a first hint of what might be wrong (in this case we see that it fails at the first read from src which contains the address `0x0000`), or walk up the stack using `gdb`’s `up` command to see what part of our code led to this situation. For more information about using `gdb` to debug native executables, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/debugging-and-diagnostics/DebugInfo/[GraalVM Debug Info Feature] guide.
ja_jp: `169` 行を調べて、何が問題なのか最初のヒントを得ることができます（この場合、アドレス `0x0000` を含む src からの最初の読み取りに失敗していることがわかります）。あるいは、 `gdb` の `up` コマンドを使ってスタックをさかのぼり、コードのどの部分がこのような状況を引き起こしたかを確認することができます。 ネイティブ実行可能ファイルのデバッグを行う `gdb` の詳細情報は link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/debugging-and-diagnostics/DebugInfo/[GraalVM デバッグ情報機能] ガイドを参照してください。

source: We can now examine line `169` and get a first hint of what might be wrong (in this case we see that it fails at the first read from src which contains the address `0x0000`), or walk up the stack using `gdb`’s `up` command to see what part of our code led to this situation. To learn more about using gdb to debug native executables see https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DebugInfo.md[here].
ja_jp: `169` 行を調べて、何が問題なのか最初のヒントを得ることができます（この場合、アドレス `0x0000` を含む src からの最初の読み取りに失敗していることがわかります）。また、 `gdb` の `up` コマンドを使ってスタックをさかのぼり、コードのどの部分がこのような状況を引き起こしたかを確認することができます。ネイティブ実行可能ファイルをデバッグするためのgdbの使い方については、 link:https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DebugInfo.md[こちら]をご覧ください。

source: We can now examine line `169` and get a first hint of what might be wrong (in this case we see that it fails at the first read from src which contains the address `0x0000`), or walk up the stack using `gdb`’s `up` command to see what part of our code led to this situation. To learn more about using gdb to debug native executables see https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/debugging-and-diagnostics/DebugInfo/[here].
ja_jp: `169` 行を調べて、何が問題なのか最初のヒントを得ることができます（この場合、アドレス `0x0000` を含む src からの最初の読み取りに失敗していることがわかります）。あるいは、 `gdb` の `up` コマンドを使ってスタックをさかのぼり、コードのどの部分がこのような状況を引き起こしたかを確認することができます。ネイティブ実行可能ファイルをデバッグするためのgdbの使い方については、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/debugging-and-diagnostics/DebugInfo/[こちら]をご覧ください。

source: We can now update `org.acme.greeting.extension.deployment.GreetingExtensionProcessor`:
ja_jp: これで `org.acme.quarkus.greeting.deployment.GreetingProcessor` を更新できるようになりました。

source: We can now wire the Rule Unit into a standard Quarkus CDI bean, for general use in the Quarkus application.
ja_jp: これで、ルールユニットを標準の Quarkus CDI Bean に接続して、Quarkus アプリケーションで一般的に使用できるようになりました。

source: We can open a JFR dump using two tools: the `jfr` CLI and JDK Mission Control (JMC). It is also possible to read them using JFR APIs, but we won't go into that in this guide.
ja_jp: JFR ダンプは、 `jfr` CLI と JDK Mission Control (JMC) の 2 つのツールを使用して開くことができます。 JFR API を使用して読み取ることも可能ですが、この点についてはこのガイドでは説明の対象外となります。

source: We can override the `maxRetries` parameter with 6 retries instead of 4 by the following configuration item:
ja_jp: 以下の設定項目により、 `maxRetries` パラメータをオーバーライドして、リトライ回数を4回から6回に変更することができます。 :
